export default function aiGenerateSurvey(text: string) {
  return `我想要创建一个问卷,接下来我给你问卷的要求或者想法：${text}。
请你返回这样的格式给我（括号里的内容是你来决定的,所有的下面的内容都由你帮我生成,不用再询问需要哪些信息。请尽量生成六个左右的单选与多选问题,返回的属性名你要带上引号,因为他们是字符串）：
{
"title": (问卷的标题),
"info":(问卷的描述信息,比如想调查什么内容等等),
"radio": [
"title":(单选1的标题),
"options":(单选1可选的选项)},
{
"title":(单选2的标题),
"options":(单选2可选的选项)},
{
"title":(单选2的标题),
"options":(单选2可选的选项)},
{
"title":(单选2的标题),
"options":(单选2可选的选项)},
...
],
"checkbox": [
{
"title":(多选1的标题),
"options":(多选1的可选项)},
{
"title":(多选2的标题),
"options":(多选2的可选项)},
{
"title":(多选2的标题),
"options":(多选2的可选项)},
{
"title":(多选2的标题),
"options":(多选2的可选项)},
...
]
}

注意,你只需要返回一个json格式的字符串,不需要返回一个对象。而且也不用再进行其他描述,我需要的是可以直接使用的字符串。`;
}
